{
  "title": "Terms of Service",
  "effective_date": "July 1, 2025",
  "sections": [
    {
      "title": "1. Acceptance of Terms",
      "content": "By accessing and using this website, you accept and agree to be bound by the terms and provision of this agreement. If you do not agree to abide by the above, please do not use this service."
    },
    {
      "title": "2. Sponsorships",
      "content": "Sponsorships are voluntary expressions of appreciation and support for open source work and contributions. All sponsorships are final and non-refundable. Sponsorships do not create any obligation to provide specific features, work, support, or deliverables. Sponsors acknowledge that they are supporting open source development without expectation of direct benefit or return. Sponsorships are not tax-deductible charitable contributions, and sponsors should consult their own tax advisors regarding tax implications."
    },
    {
      "title": "3. No Special Relationship",
      "content": "Sponsorships do not create an employer-employee relationship, client-contractor relationship, partnership, joint venture, or any form of fiduciary relationship between sponsors and the site owner. Sponsors have no right to direct or control any work, and no agency relationship is created. Any open source work remains subject to its applicable open source license terms."
    },
    {
      "title": "4. Third-Party Platforms",
      "content": "Sponsorships may be processed through third-party platforms such as GitHub Sponsors, Patreon, or other payment processors. Use of these platforms is subject to their respective terms of service and privacy policies. We are not responsible for any issues, fees, or disputes arising from the use of third-party platforms. Visibility of sponsorship information on third-party platforms is governed by those platforms' settings and policies."
    },
    {
      "title": "5. Disclaimer",
      "content": "The materials on this website are provided on an 'as is' basis. We make no warranties, expressed or implied, and hereby disclaim and negate all other warranties including, without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights."
    },
    {
      "title": "6. Limitations",
      "content": "In no event shall our company or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption) arising out of the use or inability to use the materials on this website, even if we or our authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you."
    },
    {
      "title": "7. Accuracy of Materials",
      "content": "The materials appearing on this website could include technical, typographical, or photographic errors. We do not warrant that any of the materials on its website are accurate, complete, or current. We may make changes to the materials contained on its website at any time without notice. However, we do not make any commitment to update the materials."
    },
    {
      "title": "8. Links",
      "content": "We have not reviewed all of the sites linked to our website and are not responsible for the contents of any such linked site. The inclusion of any link does not imply endorsement by us of the site. Use of any such linked website is at the user's own risk."
    },
    {
      "title": "9. Modifications",
      "content": "We may revise these terms of service for its website at any time without notice. By using this website, you are agreeing to be bound by the then current version of these terms of service."
    },
    {
      "title": "10. Governing Law",
      "content": "These terms and conditions are governed by and construed in accordance with the laws of the State of Ohio, without reference to the conflicts of law rules of that or any other jurisdiction, and you irrevocably submit to the exclusive jurisdiction of the courts in that State."
    }
  ]
}